Project/Toir/src/Reports/торо_ПланФактныйАнализППР/торо_ПланФактныйАнализППР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_ПланФактныйАнализППР</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/КалендарныеГрафики/КалендарныеГрафики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КалендарныеГрафики</name>
  <resources>
    <name>ДеньВключенВГрафик</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейВГрафикеСНачалаГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаГрафика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_базы_расчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_замещающего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ТекущееСостояниеОР/торо_ТекущееСостояниеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ТекущееСостояниеОР</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидЭксплуатации</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаПростоя</name>
    <type>
      <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/AccumulationRegisters/торо_ОстановленноеОборудование/торо_ОстановленноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ОстановленноеОборудование</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПростоя</name>
    <type>
      <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/InformationRegisters/торо_СоответствиеКорректировокДокументамППР/торо_СоответствиеКорректировокДокументамППР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СоответствиеКорректировокДокументамППР</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Корректировка</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корректируемый</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ТипЭксплуатации/торо_ТипЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипЭксплуатации</name>
  <enumValues>
    <name>Эксплуатация</name>
  </enumValues>
  <enumValues>
    <name>Простой</name>
  </enumValues>
  <enumValues>
    <name>Испытания</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Reports/торо_ПланФактныйАнализППР/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ
Перем ИспользоватьУчетСостоянийОборудования;                    

#Область ОбработчикиСобытий
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
		ИдентификаторПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).ИдентификаторПользовательскойНастройки;
		ЗначениеПериода = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПериода).Значение;
		НеИспользоватьПериод = Не КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПериода).Использование;
		
		Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
		СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
		
		Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
			ТекИерархия = СтрокаПараметр.Значение;
		Иначе
			ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
			Если СтрокаПараметр <> Неопределено Тогда
				СтрокаПараметр.Значение = ТекИерархия;
			КонецЕсли;
			
		КонецЕсли;
		
		торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаОкончания");
		
		Если ТекИерархия.СтроитсяАвтоматически Тогда
			
			СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
			ПолучитьСодержательнуюЧастьЗапроса(ЗначениеПериода, НеИспользоватьПериод)+
			"ВЫБРАТЬ
			|	ЕСТЬNULL(ВТ_ФинДанные.ЭтоПлан, 0) КАК ЭтоПлан,
			|	ЕСТЬNULL(ВТ_ФинДанные.ЭтоФакт, 0) КАК ЭтоФакт,
			|	ЕСТЬNULL(ВТ_ФинДанные.ЭтоОстанов, 0) КАК ЭтоОстанов,
			|	ЕСТЬNULL(ВТ_ФинДанные.ВСрок, 0) КАК ВСрок,
			|	ЕСТЬNULL(ВТ_ФинДанные.Позже, 0) КАК Позже,
			|	ЕСТЬNULL(ВТ_ФинДанные.Раньше, 0) КАК Раньше,
			|	ЕСТЬNULL(ВТ_ФинДанные.Всего, 0) КАК Всего,
			|	ЕСТЬNULL(ВТ_ФинДанные.ПроцентВСрок, 0) КАК ПроцентВСрок,
			|	ЕСТЬNULL(ВТ_ФинДанные.ПроцентПозже, 0) КАК ПроцентПозже,
			|	ЕСТЬNULL(ВТ_ФинДанные.ПроцентРаньше, 0) КАК ПроцентРаньше,
			|	ВТ_ФинДанные.Объект КАК Объект,
			|	ВТ_ФинДанные.ВидРемонта КАК ВидРемонта,
			|	ВТ_ФинДанные.Вид КАК Вид,
			|	ЕСТЬNULL(ВТ_ФинДанные.ЗначРесурса, 0) КАК ЗначРесурса,
			|	ВТ_ФинДанные.ДатаНачала КАК ДатаНачала,
			|	ВТ_ФинДанные.ID КАК ID,
			|	ВТ_ФинДанные.Объект." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
			|ИЗ
			|	ВТ_ФинальныеДанные КАК ВТ_ФинДанные";
			
			торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
			
		Иначе
			
			торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);
			
			СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
			ПолучитьСодержательнуюЧастьЗапроса(ЗначениеПериода, НеИспользоватьПериод)+
			"ВЫБРАТЬ
			|	ЕСТЬNULL(ВТ_ФинДанные.ЭтоПлан, 0) КАК ЭтоПлан,
			|	ЕСТЬNULL(ВТ_ФинДанные.ЭтоФакт, 0) КАК ЭтоФакт,
			|	ЕСТЬNULL(ВТ_ФинДанные.ЭтоОстанов, 0) КАК ЭтоОстанов,
			|	ЕСТЬNULL(ВТ_ФинДанные.ВСрок, 0) КАК ВСрок,
			|	ЕСТЬNULL(ВТ_ФинДанные.Позже, 0) КАК Позже,
			|	ЕСТЬNULL(ВТ_ФинДанные.Раньше, 0) КАК Раньше,
			|	ЕСТЬNULL(ВТ_ФинДанные.Всего, 0) КАК Всего,
			|	ЕСТЬNULL(ВТ_ФинДанные.ПроцентВСрок, 0) КАК ПроцентВСрок,
			|	ЕСТЬNULL(ВТ_ФинДанные.ПроцентПозже, 0) КАК ПроцентПозже,
			|	ЕСТЬNULL(ВТ_ФинДанные.ПроцентРаньше, 0) КАК ПроцентРаньше,
			|	ВТ_ФинДанные.Объект КАК Объект,
			|	ВТ_ФинДанные.ВидРемонта КАК ВидРемонта,
			|	ВТ_ФинДанные.Вид КАК Вид,
			|	ЕСТЬNULL(ВТ_ФинДанные.ЗначРесурса, 0) КАК ЗначРесурса,
			|	ВТ_ФинДанные.ДатаНачала КАК ДатаНачала,
			|	ВТ_ФинДанные.ID КАК ID,
			|	ВТ_ФинДанные.Объект КАК ОбъектИерархии
			|ИЗ
			|	ВТ_ФинальныеДанные КАК ВТ_ФинДанные";
			
		КонецЕсли;
		
		Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Периодичность")).ИдентификаторПользовательскойНастройки;
		МетодРазбиения = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор).Значение;
		ГруппировкаОтч = КомпоновщикНастроек.Настройки.Структура[1].Колонки[0].ПоляГруппировки.Элементы[0];
		
		Для каждого Элем Из КомпоновщикНастроек.Настройки.Структура Цикл
			Если элем.Имя = "Таблица" тогда
				ТаблицаГрафик = элем;
				прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ТаблицаГрафик <> Неопределено Тогда
			
			ГрупВидРемонта = НайтиДанные("ВидРемонта", ТаблицаГрафик.Строки);
			Если ГрупВидРемонта <> Неопределено Тогда
				Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПоказыватьВидыРемонта")).ИдентификаторПользовательскойНастройки;
				Флаг = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор).Значение;
				ГрупВидРемонта.Использование = Флаг;
			КонецЕсли;
			
		КонецЕсли;
		
		Если МетодРазбиения = Перечисления.Периодичность.День Тогда
			ГруппировкаОтч.ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.День;
		ИначеЕсли МетодРазбиения = Перечисления.Периодичность.Неделя Тогда
			ГруппировкаОтч.ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.Неделя;
		ИначеЕсли МетодРазбиения = Перечисления.Периодичность.Месяц Тогда
			ГруппировкаОтч.ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.Месяц;
		ИначеЕсли МетодРазбиения = Перечисления.Периодичность.Квартал Тогда
			ГруппировкаОтч.ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.Квартал;
		Иначе
			ГруппировкаОтч.ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.Год;	
		КонецЕсли;
		
		Если НеИспользоватьПериод Тогда 
			ПараметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
			ПараметрДатаНачала.Использование = Ложь;
			ПараметрДатаОкончания = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОкончания"));
			ПараметрДатаОкончания.Использование = Ложь;
		Иначе 
			ПараметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
			ПараметрДатаНачала.Использование = Истина;
			ПараметрДатаОкончания = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОкончания"));
			ПараметрДатаОкончания.Использование = Истина;
		КонецЕсли;
		
	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	дс_ЗаполнитьВычисляемыеПоля();
	дс_ДобавитьПараметрыВСКД();
	дс_УстановитьУсловноеОформление();
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция НайтиДанные(ИмяПоиска, МестоПоиска)
	
	Для каждого Элемент Из МестоПоиска Цикл
		Если Элемент.Имя = ИмяПоиска Тогда
			
			Возврат Элемент;
			
		Иначе
			
			Результат = НайтиДанные(ИмяПоиска, Элемент.Структура);
			Если Результат <> Неопределено Тогда
				Возврат Результат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриЗагрузкеПользовательскихНастроекНаСервере = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;
	Настройки.События.ПослеЗаполненияПанелиБыстрыхНастроек = Истина;
КонецПроцедуры

Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы);
	
КонецПроцедуры

Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;	
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы);
	
КонецПроцедуры

Процедура ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы)
	
	Если НЕ ИспользоватьУчетСостоянийОборудования Тогда
		Для каждого Элемент Из ПользовательскиеНастройкиЭлементы Цикл
			Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
				Если Строка(Элемент.Параметр) = "ОтображатьПростоиБезПлановыхРемонтов"
					ИЛИ Строка(Элемент.Параметр) = "ПричинаПростояВидимая"
					ИЛИ Строка(Элемент.Параметр) = "ОтображатьОстановыОборудования"
					ИЛИ Строка(Элемент.Параметр) = "ВидПростояВидимый" Тогда
					Элемент.Значение      = Ложь;
					Элемент.Использование = Ложь;
					Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
	
КонецПроцедуры

Функция ПолучитьЗначениеФО(НаименованиеФО) Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию(НаименованиеФО);
	
КонецФункции

Функция ПолучитьСодержательнуюЧастьЗапроса(ЗначениеПериода, НеИспользоватьПериод) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КалендарныеГрафики.ДатаГрафика
	|ИЗ
	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|ГДЕ
	|	(&НеИспользоватьПериод ИЛИ (КалендарныеГрафики.ДатаГрафика МЕЖДУ &ДатаНачала И &ДатаОкончания))
	|	И КалендарныеГрафики.Календарь = &Календарь";
	
	Запрос.УстановитьПараметр("ДатаНачала", ЗначениеПериода.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ЗначениеПериода.ДатаОкончания);
	Запрос.УстановитьПараметр("Календарь", Константы.торо_ГрафикРемонтныхРабот.Получить());
	Запрос.УстановитьПараметр("НеИспользоватьПериод", НеИспользоватьПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ЗапросТекст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ПланГрафикРемонта.ВидРемонтныхРабот КАК ВидРемонта,
		|	торо_ПланГрафикРемонта.ОбъектРемонтныхРабот КАК Объект,
		|	торо_ПланГрафикРемонта.ДатаОкончанияРемонтныхРабот КАК ДатаОкончания,
		|	торо_ПланГрафикРемонта.ID КАК ID,
		|	торо_ПланГрафикРемонта.ДатаНачалаРемонтныхРабот КАК ДатаНачала
		|ПОМЕСТИТЬ ТабПлан
		|ИЗ
		|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК торо_ПланГрафикРемонта
		|ГДЕ
		|	НЕ торо_ПланГрафикРемонта.Отменен
		|	И НЕ торо_ПланГрафикРемонта.Замещен
		|	И ВЫБОР
		|			КОГДА &СсылкаНаППР = ЗНАЧЕНИЕ(Документ.торо_ПланГрафикРемонта.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ торо_ПланГрафикРемонта.Регистратор В (&СсылкаНаППР)
		|		КОНЕЦ
		|{ГДЕ
		|	(торо_ПланГрафикРемонта.ДатаНачалаРемонтныхРабот МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ торо_ПланГрафикРемонта.ДатаОкончанияРемонтныхРабот МЕЖДУ &ДатаНачала И &ДатаОкончания)}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ЗавершенныеРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонта,
		|	торо_ЗавершенныеРемонтныеРаботы.ОбъектРемонта КАК Объект,
		|	ВЫБОР
		|		КОГДА МИНИМУМ(торо_ЗавершенныеРемонтныеРаботы.ДатаНачала) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА МАКСИМУМ(торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания)
		|		ИНАЧЕ МИНИМУМ(торо_ЗавершенныеРемонтныеРаботы.ДатаНачала)
		|	КОНЕЦ КАК ДатаНачала,
		|	МАКСИМУМ(торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания) КАК ДатаОкончания,
		|	торо_ЗавершенныеРемонтныеРаботы.ID
		|ПОМЕСТИТЬ ИтогТаб
		|ИЗ
		|	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|		ПО торо_ЗавершенныеРемонтныеРаботы.ID = торо_Ремонты.ID
		|ГДЕ
		|	торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта
		|{ГДЕ
		|	(торо_ЗавершенныеРемонтныеРаботы.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания)}
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_Ремонты.ID,
		|	торо_ЗавершенныеРемонтныеРаботы.ОбъектРемонта,
		|	торо_ЗавершенныеРемонтныеРаботы.ВидРемонтныхРабот,
		|	торо_ЗавершенныеРемонтныеРаботы.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтогТаб.ВидРемонта,
		|	ИтогТаб.Объект,
		|	КОНЕЦПЕРИОДА(ИтогТаб.ДатаОкончания, ДЕНЬ) КАК ДатаОкончания,
		|	ИтогТаб.ДатаОкончания КАК ДатаОкончанияНастоящая,
		|	ИтогТаб.ID,
		|	НАЧАЛОПЕРИОДА(ИтогТаб.ДатаНачала, ДЕНЬ) КАК ДатаНачала,
		|	ИтогТаб.ДатаНачала КАК ДатаНачалаНастоящая
		|ПОМЕСТИТЬ ТабФакт
		|ИЗ
		|	ИтогТаб КАК ИтогТаб
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ВидыЭксплуатации.Ссылка
		|ПОМЕСТИТЬ ЭксплуатацияПростой
		|ИЗ
		|	Справочник.торо_ВидыЭксплуатации КАК торо_ВидыЭксплуатации
		|ГДЕ
		|	(&ОтображатьОстановыОборудования
		|			ИЛИ &ОтображатьПростоиБезПлановыхРемонтов)
		|	И торо_ВидыЭксплуатации.ТипЭксплуатации = ЗНАЧЕНИЕ(Перечисление.торо_ТипЭксплуатации.Простой)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТекущееСостояниеОР.ВидЭксплуатации КАК ВидЭксплуатации,
		|	торо_ТекущееСостояниеОР.ОбъектРемонта,
		|	торо_ТекущееСостояниеОР.Период КАК Период,
		|	торо_ТекущееСостояниеОР.Регистратор
		|ПОМЕСТИТЬ ТаблицаСостояний
		|ИЗ
		|	РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
		|ГДЕ
		|	(&ОтображатьОстановыОборудования
		|			ИЛИ &ОтображатьПростоиБезПлановыхРемонтов)
		|	И ВЫБОР
		|			КОГДА НЕ &ОтображатьПростоиБезПлановыхРемонтов
		|				ТОГДА торо_ТекущееСостояниеОР.ОбъектРемонта В
		|						(ВЫБРАТЬ
		|							торо_ПланГрафикРемонта.Объект
		|						ИЗ
		|							ТабПлан КАК торо_ПланГрафикРемонта)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСостояний.ВидЭксплуатации КАК ВидЭксплуатации,
		|	ТаблицаСостояний.ОбъектРемонта,
		|	ТаблицаСостояний.Период КАК Период,
		|	МИНИМУМ(ЕСТЬNULL(ВспромогательнаяТаблица.Период, &ДатаОкончания)) КАК ДатаКон,
		|	торо_ОстановленноеОборудование.ПричинаПростоя,
		|	торо_ОстановленноеОборудование.ПричинаПростоя.ВидПростоя КАК ВидПростоя
		|ПОМЕСТИТЬ ПростоиОР
		|ИЗ
		|	ТаблицаСостояний КАК ТаблицаСостояний
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСостояний КАК ВспромогательнаяТаблица
		|		ПО ТаблицаСостояний.Период < ВспромогательнаяТаблица.Период
		|			И ТаблицаСостояний.ОбъектРемонта = ВспромогательнаяТаблица.ОбъектРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ОстановленноеОборудование КАК торо_ОстановленноеОборудование
		|		ПО ТаблицаСостояний.ОбъектРемонта = торо_ОстановленноеОборудование.ОбъектРемонта
		|			И ТаблицаСостояний.Период = торо_ОстановленноеОборудование.Период
		|			И ТаблицаСостояний.Регистратор = торо_ОстановленноеОборудование.Регистратор
		|ГДЕ
		|	ТаблицаСостояний.ВидЭксплуатации В
		|			(ВЫБРАТЬ
		|				ЭксплуатацияПростой.Ссылка
		|			ИЗ
		|				ЭксплуатацияПростой КАК ЭксплуатацияПростой)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаСостояний.ОбъектРемонта,
		|	ТаблицаСостояний.Период,
		|	ТаблицаСостояний.ВидЭксплуатации,
		|	торо_ОстановленноеОборудование.ПричинаПростоя,
		|	торо_ОстановленноеОборудование.ПричинаПростоя.ВидПростоя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПростоиОР.ОбъектРемонта КАК Объект,
		|	ВЫБОР
		|		КОГДА ПростоиОР.Период < &ДатаНачала И НЕ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) 
		|			ТОГДА &ДатаНачала
		|		ИНАЧЕ ПростоиОР.Период
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА ПростоиОР.ДатаКон > &ДатаОкончания И НЕ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА &ДатаОкончания
		|		ИНАЧЕ ПростоиОР.ДатаКон
		|	КОНЕЦ КАК ДатаОкончания
		|ПОМЕСТИТЬ ВремТаб
		|ИЗ
		|	ПростоиОР КАК ПростоиОР
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ВидПростоя = ЗНАЧЕНИЕ(Перечисление.торо_ВидыПростояОборудования.ПустаяСсылка)
		|					ИЛИ &ВидПростоя = ИСТИНА
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПростоиОР.ВидПростоя = &ВидПростоя
		|		КОНЕЦ И 
		|	ВЫБОР
		|			КОГДА &ПричинаПростоя = ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПростоиОР.ПричинаПростоя = &ПричинаПростоя
		|		КОНЕЦ
		|{ГДЕ
		|	(ПростоиОР.Период > &ДатаНачала
		|				И ПростоиОР.Период < &ДатаОкончания
		|			ИЛИ ПростоиОР.ДатаКон > &ДатаНачала
		|				И ПростоиОР.ДатаКон < &ДатаОкончания)}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабПлан.ВидРемонта КАК ВидРемонта,
		|	ВремТаб.Объект,
		|	ВремТаб.ДатаОкончания,
		|	NULL КАК ID,
		|	ВремТаб.ДатаНачала КАК ДатаНачала
		|ПОМЕСТИТЬ ТабОстанов
		|ИЗ
		|	ВремТаб КАК ВремТаб
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПлан КАК ТабПлан
		|		ПО (ТабПлан.Объект = ВремТаб.Объект)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ &ОтображатьПростоиБезПлановыхРемонтов
		|				ТОГДА НЕ ТабПлан.ВидРемонта ЕСТЬ NULL 
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабПлан.Объект КАК Объект,
		|	ТабПлан.ВидРемонта КАК ВидРемонта,
		|	ТабПлан.ДатаНачала КАК ДатаНачала,
		|	ТабПлан.ДатаОкончания КАК ДатаОкончания,
		|	ТабПлан.ID,
		|	""План"" КАК Вид
		|ПОМЕСТИТЬ ТабДат
		|ИЗ
		|	ТабПлан КАК ТабПлан
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабФакт.Объект,
		|	ТабФакт.ВидРемонта,
		|	ТабФакт.ДатаНачала,
		|	ТабФакт.ДатаОкончания,
		|	ТабФакт.ID,
		|	""Факт""
		|ИЗ
		|	ТабФакт КАК ТабФакт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабОстанов.Объект,
		|	ТабОстанов.ВидРемонта,
		|	ТабОстанов.ДатаНачала,
		|	ТабОстанов.ДатаОкончания,
		|	ТабОстанов.ID,
		|	""Останов""
		|ИЗ
		|	ТабОстанов КАК ТабОстанов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабДат.Объект,
		|	ТабДат.ВидРемонта,
		|	ТабДат.Вид,
		|	ТабДат.ID,
		|	ТабДат.ДатаНачала КАК НачалоРемонта,
		|	1 КАК ЗначРесурса,
		|	ВЫБОР
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
		|			ТОГДА НАЧАЛОПЕРИОДА(ТабДат.ДатаНачала, ДЕНЬ)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|			ТОГДА НАЧАЛОПЕРИОДА(ТабДат.ДатаНачала, МЕСЯЦ)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|			ТОГДА НАЧАЛОПЕРИОДА(ТабДат.ДатаНачала, ГОД)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|			ТОГДА НАЧАЛОПЕРИОДА(ТабДат.ДатаНачала, КВАРТАЛ)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|			ТОГДА НАЧАЛОПЕРИОДА(ТабДат.ДатаНачала, НЕДЕЛЯ)
		|	КОНЕЦ КАК ДатаНачала
		|ПОМЕСТИТЬ ВТ_ДанныеТаблицы
		|ИЗ
		|	ТабДат КАК ТабДат
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабДат.Объект,
		|	ТабДат.Вид,
		|	ТабДат.ID,
		|	ТабДат.ВидРемонта,
		|	ВЫБОР
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
		|			ТОГДА НАЧАЛОПЕРИОДА(ТабДат.ДатаНачала, ДЕНЬ)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|			ТОГДА НАЧАЛОПЕРИОДА(ТабДат.ДатаНачала, МЕСЯЦ)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|			ТОГДА НАЧАЛОПЕРИОДА(ТабДат.ДатаНачала, ГОД)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|			ТОГДА НАЧАЛОПЕРИОДА(ТабДат.ДатаНачала, КВАРТАЛ)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|			ТОГДА НАЧАЛОПЕРИОДА(ТабДат.ДатаНачала, НЕДЕЛЯ)
		|	КОНЕЦ,
		|	ТабДат.ДатаНачала
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ТабДат.ID,
		|	ТабДат.Вид
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабПлан.Объект,
		|	ТабПлан.ID КАК ID,
		|	ТабПлан.ДатаНачала,
		|	ТабПлан.ДатаОкончания,
		|	""План"" КАК Вид,
		|	1 КАК ЭтоПлан
		|ПОМЕСТИТЬ ВТ_План
		|ИЗ
		|	ТабПлан КАК ТабПлан
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабПлан.Объект,
		|	ТабПлан.ID,
		|	ТабПлан.ДатаНачала,
		|	ТабПлан.ДатаОкончания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабФакт.Объект,
		|	ТабФакт.ID КАК ID,
		|	ТабФакт.ДатаНачалаНастоящая КАК ДатаНачала,
		|	ТабФакт.ДатаОкончанияНастоящая КАК ДатаОкончания,
		|	""Факт"" КАК Вид,
		|	1 КАК ЭтоФакт
		|ПОМЕСТИТЬ ВТ_Факт
		|ИЗ
		|	ТабФакт КАК ТабФакт
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабФакт.Объект,
		|	ТабФакт.ID,
		|	ТабФакт.ДатаНачалаНастоящая,
		|	ТабФакт.ДатаОкончанияНастоящая
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_План.ЭтоПлан, 0) КАК ЭтоПлан,
		|	ЕСТЬNULL(ВТ_Факт.ЭтоФакт, 0) КАК ЭтоФакт,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_План.Вид ЕСТЬ NULL 
		|			ТОГДА ВТ_План.Вид
		|		ИНАЧЕ ВТ_Факт.Вид
		|	КОНЕЦ КАК Вид,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_План.Объект ЕСТЬ NULL 
		|				И НЕ ВТ_Факт.Объект ЕСТЬ NULL 
		|				И ВТ_Факт.ДатаНачала >= ВТ_План.ДатаНачала
		|				И ВТ_Факт.ДатаОкончания <= КонецПериода(ВТ_План.ДатаОкончания, ДЕНЬ)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВСрок,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_План.Объект ЕСТЬ NULL 
		|				И НЕ ВТ_Факт.Объект ЕСТЬ NULL 
		|				И ВТ_Факт.ДатаОкончания > КонецПериода(ВТ_План.ДатаОкончания, ДЕНЬ)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Позже,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_План.Объект ЕСТЬ NULL 
		|				И НЕ ВТ_Факт.Объект ЕСТЬ NULL 
		|				И ВТ_Факт.ДатаНачала < ВТ_План.ДатаНачала
		|				И ВТ_Факт.ДатаОкончания <= КонецПериода(ВТ_План.ДатаОкончания, ДЕНЬ)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Раньше,
		|	1 КАК Всего,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_Факт.ID ЕСТЬ NULL 
		|			ТОГДА ВТ_Факт.ID
		|		ИНАЧЕ ВТ_План.ID
		|	КОНЕЦ КАК ID,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_Факт.ID ЕСТЬ NULL 
		|			ТОГДА ВТ_Факт.ДатаНачала
		|		ИНАЧЕ ВТ_План.ДатаНачала
		|	КОНЕЦ КАК НачалоРемонта
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	ВТ_План КАК ВТ_План
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Факт КАК ВТ_Факт
		|		ПО ВТ_План.ID = ВТ_Факт.ID
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID,
		|	Вид
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""План""
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЭтоПлан,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""Факт""
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЭтоФакт,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""Останов""
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЭтоОстанов,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""Факт""
		|			ТОГДА ВТ_Данные.ВСрок
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВСрок,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""Факт""
		|			ТОГДА ВТ_Данные.Позже
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Позже,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""Факт""
		|			ТОГДА ВТ_Данные.Раньше
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Раньше,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""Факт""
		|			ТОГДА ВТ_Данные.Всего
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Всего,
		|	ВЫБОР
		|		КОГДА ВТ_Данные.Всего = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Данные.ВСрок / ВТ_Данные.Всего * 100
		|	КОНЕЦ КАК ПроцентВСрок,
		|	ВЫБОР
		|		КОГДА ВТ_Данные.Всего = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Данные.Позже / ВТ_Данные.Всего * 100
		|	КОНЕЦ КАК ПроцентПозже,
		|	ВЫБОР
		|		КОГДА ВТ_Данные.Всего = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Данные.Раньше / ВТ_Данные.Всего * 100
		|	КОНЕЦ КАК ПроцентРаньше,
		|	торо_ОбъектыРемонта.Ссылка КАК Объект,
		|	ВТ_ДанныеТаблицы.ВидРемонта,
		|	ВТ_ДанныеТаблицы.Вид,
		|	ВТ_ДанныеТаблицы.ЗначРесурса,
		|	ВТ_ДанныеТаблицы.ДатаНачала,
		|	ВТ_ДанныеТаблицы.ID
		|ПОМЕСТИТЬ ВТ_ФинальныеДанные
		|ИЗ
		|	ВТ_ДанныеТаблицы КАК ВТ_ДанныеТаблицы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Данные КАК ВТ_Данные
		|		ПО ВТ_ДанныеТаблицы.ID = ВТ_Данные.ID
		|			//И (ВТ_ДанныеТаблицы.НачалоРемонта = НАЧАЛОПЕРИОДА(ВТ_Данные.НачалоРемонта, ДЕНЬ))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_ДанныеТаблицы.Объект = торо_ОбъектыРемонта.Ссылка";
		
	Иначе
		
		ЗапросТекст = 
		"ВЫБРАТЬ
		|	&СсылкаНаППР КАК Корректировка
		|ПОМЕСТИТЬ ВТ_ППРсКорректировками
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_СоответствиеКорректировокДокументамППР.Корректировка
		|ИЗ
		|	РегистрСведений.торо_СоответствиеКорректировокДокументамППР КАК торо_СоответствиеКорректировокДокументамППР
		|ГДЕ
		|	торо_СоответствиеКорректировокДокументамППР.Корректируемый = &СсылкаНаППР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ПланГрафикРемонта.ВидРемонтныхРабот КАК ВидРемонта,
		|	торо_ПланГрафикРемонта.ОбъектРемонтныхРабот КАК Объект,
		|	торо_ПланГрафикРемонта.ДатаОкончанияРемонтныхРабот КАК ДатаОкончания,
		|	торо_ПланГрафикРемонта.ID КАК ID,
		|	торо_ПланГрафикРемонта.ДатаНачалаРемонтныхРабот КАК ДатаНачала
		|ПОМЕСТИТЬ ТабПлан
		|ИЗ
		|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК торо_ПланГрафикРемонта
		|ГДЕ
		|	НЕ торо_ПланГрафикРемонта.Отменен
		|	И НЕ торо_ПланГрафикРемонта.Замещен
		|	И ВЫБОР
		|			КОГДА &СсылкаНаППР = ЗНАЧЕНИЕ(Документ.торо_ПланГрафикРемонта.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ торо_ПланГрафикРемонта.Регистратор В
		|					(ВЫБРАТЬ
		|						ВТ_ППРсКорректировками.Корректировка
		|					ИЗ
		|						ВТ_ППРсКорректировками КАК ВТ_ППРсКорректировками)
		|		КОНЕЦ
		|{ГДЕ
		|	(торо_ПланГрафикРемонта.ДатаНачалаРемонтныхРабот МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ торо_ПланГрафикРемонта.ДатаОкончанияРемонтныхРабот МЕЖДУ &ДатаНачала И &ДатаОкончания)}
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект,
		|	ДатаОкончания,
		|	ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ЗавершенныеРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонта,
		|	торо_ЗавершенныеРемонтныеРаботы.ОбъектРемонта КАК Объект,
		|	ВЫБОР
		|		КОГДА МИНИМУМ(торо_ЗавершенныеРемонтныеРаботы.ДатаНачала) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА МАКСИМУМ(торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания)
		|		ИНАЧЕ МИНИМУМ(торо_ЗавершенныеРемонтныеРаботы.ДатаНачала)
		|	КОНЕЦ КАК ДатаНачала,
		|	МАКСИМУМ(торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания) КАК ДатаОкончания,
		|	торо_ЗавершенныеРемонтныеРаботы.ID КАК ID
		|ПОМЕСТИТЬ ИтогТаб
		|ИЗ
		|	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|		ПО торо_ЗавершенныеРемонтныеРаботы.ID = торо_Ремонты.ID
		|ГДЕ
		|	торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта
		|	И ВЫБОР
		|			КОГДА &СсылкаНаППР = ЗНАЧЕНИЕ(Документ.торо_ПланГрафикРемонта.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ торо_Ремонты.Регистратор В
		|					(ВЫБРАТЬ
		|						ВТ_ППРсКорректировками.Корректировка
		|					ИЗ
		|						ВТ_ППРсКорректировками КАК ВТ_ППРсКорректировками)
		|		КОНЕЦ
		|{ГДЕ
		|	(торо_ЗавершенныеРемонтныеРаботы.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания)}
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_Ремонты.ID,
		|	торо_ЗавершенныеРемонтныеРаботы.ОбъектРемонта,
		|	торо_ЗавершенныеРемонтныеРаботы.ВидРемонтныхРабот,
		|	торо_ЗавершенныеРемонтныеРаботы.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтогТаб.ВидРемонта КАК ВидРемонта,
		|	ИтогТаб.Объект КАК Объект,
		|	КОНЕЦПЕРИОДА(ИтогТаб.ДатаОкончания, ДЕНЬ) КАК ДатаОкончания,
		|	ИтогТаб.ДатаОкончания КАК ДатаОкончанияНастоящая,
		|	ИтогТаб.ID КАК ID,
		|	НАЧАЛОПЕРИОДА(ИтогТаб.ДатаНачала, ДЕНЬ) КАК ДатаНачала,
		|	ИтогТаб.ДатаНачала КАК ДатаНачалаНастоящая
		|ПОМЕСТИТЬ ТабФакт
		|ИЗ
		|	ИтогТаб КАК ИтогТаб
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДатаОкончания,
		|	ДатаНачала,
		|	ДатаОкончанияНастоящая,
		|	ДатаНачалаНастоящая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ВидыЭксплуатации.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ЭксплуатацияПростой
		|ИЗ
		|	Справочник.торо_ВидыЭксплуатации КАК торо_ВидыЭксплуатации
		|ГДЕ
		|	&ОтображатьОстановыОборудования
		|	И торо_ВидыЭксплуатации.ТипЭксплуатации = ЗНАЧЕНИЕ(Перечисление.торо_ТипЭксплуатации.Простой)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТекущееСостояниеОР.ВидЭксплуатации КАК ВидЭксплуатации,
		|	торо_ТекущееСостояниеОР.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ТекущееСостояниеОР.Период КАК Период,
		|	торо_ТекущееСостояниеОР.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ТаблицаСостояний
		|ИЗ
		|	РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
		|ГДЕ
		|	&ОтображатьОстановыОборудования
		|	И ВЫБОР
		|			КОГДА НЕ &ОтображатьПростоиБезПлановыхРемонтов
		|				ТОГДА торо_ТекущееСостояниеОР.ОбъектРемонта В
		|						(ВЫБРАТЬ
		|							торо_ПланГрафикРемонта.Объект
		|						ИЗ
		|							ТабПлан КАК торо_ПланГрафикРемонта)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	ОбъектРемонта,
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСостояний.ВидЭксплуатации КАК ВидЭксплуатации,
		|	ТаблицаСостояний.ОбъектРемонта КАК ОбъектРемонта,
		|	ТаблицаСостояний.Период КАК Период,
		|	МИНИМУМ(ЕСТЬNULL(ВспромогательнаяТаблица.Период, &ДатаОкончания)) КАК ДатаКон,
		|	торо_ОстановленноеОборудование.ПричинаПростоя КАК ПричинаПростоя,
		|	торо_ОстановленноеОборудование.ПричинаПростоя.ВидПростоя КАК ВидПростоя
		|ПОМЕСТИТЬ ПростоиОР
		|ИЗ
		|	ТаблицаСостояний КАК ТаблицаСостояний
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСостояний КАК ВспромогательнаяТаблица
		|		ПО ТаблицаСостояний.Период < ВспромогательнаяТаблица.Период
		|			И ТаблицаСостояний.ОбъектРемонта = ВспромогательнаяТаблица.ОбъектРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ОстановленноеОборудование КАК торо_ОстановленноеОборудование
		|		ПО ТаблицаСостояний.ОбъектРемонта = торо_ОстановленноеОборудование.ОбъектРемонта
		|			И ТаблицаСостояний.Период = торо_ОстановленноеОборудование.Период
		|			И ТаблицаСостояний.Регистратор = торо_ОстановленноеОборудование.Регистратор
		|ГДЕ
		|	ТаблицаСостояний.ВидЭксплуатации В
		|			(ВЫБРАТЬ
		|				ЭксплуатацияПростой.Ссылка
		|			ИЗ
		|				ЭксплуатацияПростой КАК ЭксплуатацияПростой)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаСостояний.ОбъектРемонта,
		|	ТаблицаСостояний.Период,
		|	ТаблицаСостояний.ВидЭксплуатации,
		|	торо_ОстановленноеОборудование.ПричинаПростоя,
		|	торо_ОстановленноеОборудование.ПричинаПростоя.ВидПростоя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПростоиОР.ОбъектРемонта КАК Объект,
		|	ВЫБОР
		|		КОГДА ПростоиОР.Период < &ДатаНачала И НЕ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА &ДатаНачала
		|		ИНАЧЕ ПростоиОР.Период
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА ПростоиОР.ДатаКон > &ДатаОкончания И НЕ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА &ДатаОкончания
		|		ИНАЧЕ ПростоиОР.ДатаКон
		|	КОНЕЦ КАК ДатаОкончания
		|ПОМЕСТИТЬ ВремТаб
		|ИЗ
		|	ПростоиОР КАК ПростоиОР
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ВидПростоя = ЗНАЧЕНИЕ(Перечисление.торо_ВидыПростояОборудования.ПустаяСсылка)
		|					ИЛИ &ВидПростоя = ИСТИНА
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПростоиОР.ВидПростоя = &ВидПростоя
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ПричинаПростоя = ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПростоиОР.ПричинаПростоя = &ПричинаПростоя
		|		КОНЕЦ
		|{ГДЕ
		|	(ПростоиОР.Период > &ДатаНачала
		|				И ПростоиОР.Период < &ДатаОкончания
		|			ИЛИ ПростоиОР.ДатаКон > &ДатаНачала
		|				И ПростоиОР.ДатаКон < &ДатаОкончания)}
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТабПлан.ВидРемонта, НЕОПРЕДЕЛЕНО) КАК ВидРемонта,
		|	ВремТаб.Объект КАК Объект,
		|	ВремТаб.ДатаНачала КАК ДатаНачала,
		|	ВремТаб.ДатаОкончания КАК ДатаОкончания,
		|	"""" КАК ID
		|ПОМЕСТИТЬ ТабОстанов
		|ИЗ
		|	ВремТаб КАК ВремТаб
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПлан КАК ТабПлан
		|		ПО (ТабПлан.Объект = ВремТаб.Объект)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ &ОтображатьПростоиБезПлановыхРемонтов
		|				ТОГДА НЕ ТабПлан.ВидРемонта ЕСТЬ NULL
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабПлан.Объект КАК Объект,
		|	ТабПлан.ВидРемонта КАК ВидРемонта,
		|	ТабПлан.ДатаНачала КАК ДатаНачала,
		|	ТабПлан.ДатаОкончания КАК ДатаОкончания,
		|	ТабПлан.ID КАК ID,
		|	""План"" КАК Вид
		|ПОМЕСТИТЬ ТабДат
		|ИЗ
		|	ТабПлан КАК ТабПлан
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабФакт.Объект,
		|	ТабФакт.ВидРемонта,
		|	ТабФакт.ДатаНачала,
		|	ТабФакт.ДатаОкончания,
		|	ТабФакт.ID,
		|	""Факт""
		|ИЗ
		|	ТабФакт КАК ТабФакт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабОстанов.Объект,
		|	ТабОстанов.ВидРемонта,
		|	ТабОстанов.ДатаНачала,
		|	ТабОстанов.ДатаОкончания,
		|	ТабОстанов.ID,
		|	""Останов""
		|ИЗ
		|	ТабОстанов КАК ТабОстанов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДатаНачала,
		|	ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КалендарныеГрафики.ДатаГрафика КАК ДатаГрафика
		|ПОМЕСТИТЬ КалендарныеДни
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.торо_ГрафикРемонтныхРабот КАК торо_ГрафикРемонтныхРабот
		|		ПО КалендарныеГрафики.Календарь = торо_ГрафикРемонтныхРабот.Значение
		|{ГДЕ
		|	(КалендарныеГрафики.ДатаГрафика МЕЖДУ &ДатаНачала И &ДатаОкончания)}
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДатаГрафика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабДат.Объект КАК Объект,
		|	ТабДат.ВидРемонта КАК ВидРемонта,
		|	ТабДат.Вид КАК Вид,
		|	1 КАК ЗначРесурса,
		|	ТабДат.ID КАК ID,
		|	ТабДат.ДатаНачала КАК НачалоРемонта,
		|	ВЫБОР
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
		|			ТОГДА НАЧАЛОПЕРИОДА(КалендарныеДни.ДатаГрафика, ДЕНЬ)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|			ТОГДА НАЧАЛОПЕРИОДА(КалендарныеДни.ДатаГрафика, МЕСЯЦ)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|			ТОГДА НАЧАЛОПЕРИОДА(КалендарныеДни.ДатаГрафика, ГОД)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|			ТОГДА НАЧАЛОПЕРИОДА(КалендарныеДни.ДатаГрафика, КВАРТАЛ)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|			ТОГДА НАЧАЛОПЕРИОДА(КалендарныеДни.ДатаГрафика, НЕДЕЛЯ)
		|	КОНЕЦ КАК ДатаНачала
		|ПОМЕСТИТЬ ВТ_ДанныеТаблицы
		|ИЗ
		|	КалендарныеДни КАК КалендарныеДни
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабДат КАК ТабДат
		|		ПО КалендарныеДни.ДатаГрафика >= НАЧАЛОПЕРИОДА(ТабДат.ДатаНачала, ДЕНЬ)
		|			И КалендарныеДни.ДатаГрафика <= ТабДат.ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабДат.Объект,
		|	ТабДат.Вид,
		|	ТабДат.ID,
		|	ТабДат.ВидРемонта,
		|	ВЫБОР
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
		|			ТОГДА НАЧАЛОПЕРИОДА(КалендарныеДни.ДатаГрафика, ДЕНЬ)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|			ТОГДА НАЧАЛОПЕРИОДА(КалендарныеДни.ДатаГрафика, МЕСЯЦ)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
		|			ТОГДА НАЧАЛОПЕРИОДА(КалендарныеДни.ДатаГрафика, ГОД)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|			ТОГДА НАЧАЛОПЕРИОДА(КалендарныеДни.ДатаГрафика, КВАРТАЛ)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
		|			ТОГДА НАЧАЛОПЕРИОДА(КалендарныеДни.ДатаГрафика, НЕДЕЛЯ)
		|	КОНЕЦ,
		|	ТабДат.ДатаНачала
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID,
		|	Вид
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабПлан.Объект КАК Объект,
		|	ТабПлан.ID КАК ID,
		|	ТабПлан.ДатаНачала КАК ДатаНачала,
		|	ТабПлан.ДатаОкончания КАК ДатаОкончания,
		|	""План"" КАК Вид,
		|	1 КАК ЭтоПлан
		|ПОМЕСТИТЬ ВТ_План
		|ИЗ
		|	КалендарныеДни КАК КалендарныеДни
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабПлан КАК ТабПлан
		|		ПО КалендарныеДни.ДатаГрафика >= ТабПлан.ДатаНачала
		|			И КалендарныеДни.ДатаГрафика <= ТабПлан.ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабПлан.Объект,
		|	ТабПлан.ID,
		|	ТабПлан.ДатаНачала,
		|	ТабПлан.ДатаОкончания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабФакт.Объект КАК Объект,
		|	ТабФакт.ID КАК ID,
		|	ТабФакт.ДатаНачалаНастоящая КАК ДатаНачала,
		|	ТабФакт.ДатаОкончанияНастоящая КАК ДатаОкончания,
		|	""Факт"" КАК Вид,
		|	1 КАК ЭтоФакт
		|ПОМЕСТИТЬ ВТ_Факт
		|ИЗ
		|	КалендарныеДни КАК КалендарныеДни
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабФакт КАК ТабФакт
		|		ПО КалендарныеДни.ДатаГрафика >= ТабФакт.ДатаНачала
		|			И КалендарныеДни.ДатаГрафика <= ТабФакт.ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабФакт.Объект,
		|	ТабФакт.ID,
		|	ТабФакт.ДатаНачалаНастоящая,
		|	ТабФакт.ДатаОкончанияНастоящая
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_План.ЭтоПлан, 0) КАК ЭтоПлан,
		|	ЕСТЬNULL(ВТ_Факт.ЭтоФакт, 0) КАК ЭтоФакт,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_План.Вид ЕСТЬ NULL
		|			ТОГДА ВТ_План.Вид
		|		ИНАЧЕ ВТ_Факт.Вид
		|	КОНЕЦ КАК Вид,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_План.Объект ЕСТЬ NULL
		|				И НЕ ВТ_Факт.Объект ЕСТЬ NULL
		|				И ВТ_Факт.ДатаНачала >= ВТ_План.ДатаНачала
		|				И ВТ_Факт.ДатаОкончания <= КОНЕЦПЕРИОДА(ВТ_План.ДатаОкончания, ДЕНЬ)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВСрок,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_План.Объект ЕСТЬ NULL
		|				И НЕ ВТ_Факт.Объект ЕСТЬ NULL
		|				И ВТ_Факт.ДатаОкончания > КОНЕЦПЕРИОДА(ВТ_План.ДатаОкончания, ДЕНЬ)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Позже,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_План.Объект ЕСТЬ NULL
		|				И НЕ ВТ_Факт.Объект ЕСТЬ NULL
		|				И ВТ_Факт.ДатаНачала < ВТ_План.ДатаНачала
		|				И ВТ_Факт.ДатаОкончания <= КОНЕЦПЕРИОДА(ВТ_План.ДатаОкончания, ДЕНЬ)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Раньше,
		|	1 КАК Всего,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_Факт.ID ЕСТЬ NULL
		|			ТОГДА ВТ_Факт.ID
		|		ИНАЧЕ ВТ_План.ID
		|	КОНЕЦ КАК ID,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_Факт.ID ЕСТЬ NULL
		|			ТОГДА ВТ_Факт.ДатаНачала
		|		ИНАЧЕ ВТ_План.ДатаНачала
		|	КОНЕЦ КАК НачалоРемонта
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	ВТ_План КАК ВТ_План
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Факт КАК ВТ_Факт
		|		ПО ВТ_План.ID = ВТ_Факт.ID
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID,
		|	Вид
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""План""
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЭтоПлан,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""Факт""
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЭтоФакт,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""Останов""
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЭтоОстанов,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""Факт""
		|			ТОГДА ЕСТЬNULL(ВТ_Данные.ВСрок, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВСрок,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""Факт""
		|			ТОГДА ЕСТЬNULL(ВТ_Данные.Позже, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Позже,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""Факт""
		|			ТОГДА ЕСТЬNULL(ВТ_Данные.Раньше, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Раньше,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеТаблицы.Вид = ""Факт""
		|			ТОГДА ЕСТЬNULL(ВТ_Данные.Всего, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Всего,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_Данные.Всего, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Данные.ВСрок / ВТ_Данные.Всего * 100
		|	КОНЕЦ КАК ПроцентВСрок,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_Данные.Всего, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Данные.Позже / ВТ_Данные.Всего * 100
		|	КОНЕЦ КАК ПроцентПозже,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_Данные.Всего, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Данные.Раньше / ВТ_Данные.Всего * 100
		|	КОНЕЦ КАК ПроцентРаньше,
		|	торо_ОбъектыРемонта.Ссылка КАК Объект,
		|	ВТ_ДанныеТаблицы.ВидРемонта КАК ВидРемонта,
		|	ВТ_ДанныеТаблицы.Вид КАК Вид,
		|	ВТ_ДанныеТаблицы.ЗначРесурса КАК ЗначРесурса,
		|	ВТ_ДанныеТаблицы.ДатаНачала КАК ДатаНачала,
		|	ЕСТЬNULL(ВТ_ДанныеТаблицы.ID, """") КАК ID
		|ПОМЕСТИТЬ ВТ_ФинальныеДанные
		|ИЗ
		|	ВТ_ДанныеТаблицы КАК ВТ_ДанныеТаблицы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Данные КАК ВТ_Данные
		|		ПО ВТ_ДанныеТаблицы.ID = ВТ_Данные.ID
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_ДанныеТаблицы.Объект = торо_ОбъектыРемонта.Ссылка";
		
	КонецЕсли;
		
	ЗапросТекст = ЗапросТекст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	ЗапросТекст = дс_ДобавитьПараметрыВТекстЗапроса(ЗапросТекст);
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 

	Возврат ЗапросТекст;
		
КонецФункции

// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
#Область Локализация

Функция дс_ДобавитьПараметрыВТекстЗапроса(ТекстЗапроса)
	СтрокиЗамены = Новый Соответствие;

	СтрокиЗамены.Вставить("""Факт""", "&Факт");
	СтрокиЗамены.Вставить("""План""", "&План");
	СтрокиЗамены.Вставить("""Останов""", "&Останов");

	Для каждого КодЗамены Из СтрокиЗамены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, КодЗамены.Ключ, КодЗамены.Значение);
	КонецЦикла;
	
	Возврат ТекстЗапроса;
КонецФункции
 
Процедура дс_ДобавитьПараметрыВСКД()
	Переводы = Новый Соответствие;
	
	Переводы.Вставить("Факт", 		НСтр("es='El hecho de';ru='Факт';en='Fact'"));
	Переводы.Вставить("План", 		НСтр("es='El plan de';ru='План';en='Plan'"));
	Переводы.Вставить("Останов", 	НСтр("es='Parada';ru='Останов';en='Stop'"));
	
	Для каждого Перевод Из Переводы Цикл
		НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить();
		НовыйПараметр.Имя 			= Перевод.Ключ;
		НовыйПараметр.Значение 		= Перевод.Значение;
		НовыйПараметр.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		НовыйПараметр.ОграничениеИспользования = Истина;
	КонецЦикла; 
КонецПроцедуры

Процедура дс_УстановитьУсловноеОформление()
	Переводы = Новый Соответствие;
	
	Переводы.Вставить("Факт", 		НСтр("es='El hecho de';ru='Факт';en='Fact'"));
	Переводы.Вставить("План", 		НСтр("es='El plan de';ru='План';en='Plan'"));
	Переводы.Вставить("Останов", 	НСтр("es='Parada';ru='Останов';en='Stop'"));
	
	УО = КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы;
	
	Элементы = Новый Массив;
	Для каждого ЭлементУО Из УО Цикл
		дс_ПолучитьВложенныеОтборы(ЭлементУО.Отбор, Элементы);
	КонецЦикла; 
	
	Для каждого ЭлементОтбора Из Элементы Цикл
		Перевод = Переводы[ЭлементОтбора.ПравоеЗначение];
		
		Если Перевод <> Неопределено Тогда
			ЭлементОтбора.ПравоеЗначение = Перевод;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

Процедура дс_ПолучитьВложенныеОтборы(Элемент, Массив)
	Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		Массив.Добавить(Элемент);
		Возврат;
	Иначе
		Для каждого ПодЭлемент Из Элемент.Элементы Цикл
			дс_ПолучитьВложенныеОтборы(ПодЭлемент, Массив);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура дс_ЗаполнитьВычисляемыеПоля()
	Поля = Новый Соответствие;
	
	Поля.Вставить("ПредставлениеДаты", "ВЫБОР КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал) Тогда Строка(Квартал(ДатаНачала)) + НСтр(""ru = ' квартал '; en = ' quarter '; es = ' trimestre '"") + Строка(Год(ДатаНачала))  КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц) Тогда  ВЫБОР КОГДА Месяц(ДатаНачала) =1 ТОГДА НСтр(""ru = 'Январь '; en = 'January '; es = 'Enero '"") + Строка(ГОД(ДатаНачала)) КОГДА Месяц(ДатаНачала)=2 ТОГДА НСтр(""ru = 'Февраль '; en = 'February '; es = 'Febrero '"") + Строка(ГОД(ДатаНачала)) КОГДА Месяц(ДатаНачала)= 3 ТОГДА НСтр(""ru = 'Март '; en = 'March '; es = 'Marzo '"") + Строка(ГОД(ДатаНачала)) КОГДА Месяц(ДатаНачала)=4 ТОГДА НСтр(""ru = 'Апрель '; en = 'April '; es = 'Abril '"") + Строка(ГОД(ДатаНачала)) КОГДА Месяц(ДатаНачала)=5 ТОГДА НСтр(""ru = 'Май '; en = 'May '; es = 'Mayo '"") + Строка(ГОД(ДатаНачала)) КОГДА Месяц(ДатаНачала)=6 ТОГДА НСтр(""ru = 'Июнь '; en = 'June '; es = 'Junio '"") + Строка(ГОД(ДатаНачала)) КОГДА Месяц(ДатаНачала)=7 ТОГДА НСтр(""ru = 'Июль '; en = 'July '; es = 'Julio '"") + Строка(ГОД(ДатаНачала)) КОГДА Месяц(ДатаНачала)= 8 ТОГДА НСтр(""ru = 'Август '; en = 'August '; es = 'Agosto '"") + Строка(ГОД(ДатаНачала)) КОГДА Месяц(ДатаНачала)=9 ТОГДА НСтр(""ru = 'Сентябрь '; en = 'September '; es = 'Septiembre '"") + Строка(ГОД(ДатаНачала)) КОГДА Месяц(ДатаНачала)=10 ТОГДА НСтр(""ru = 'Октябрь '; en = 'October '; es = 'Octubre '"") + Строка(ГОД(ДатаНачала)) КОГДА Месяц(ДатаНачала)=11 ТОГДА НСтр(""ru = 'Ноябрь '; en = 'November '; es = 'Noviembre '"") + Строка(ГОД(ДатаНачала)) КОГДА Месяц(ДатаНачала)=12 ТОГДА НСтр(""ru = 'Декабрь '; en = 'December '; es = 'Diciembre '"") + Строка(ГОД(ДатаНачала)) КОНЕЦ КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя) Тогда Строка(Неделя(ДатаНачала)) + НСтр(""ru = ' неделя '; en = ' week '; es = ' la semana '"") + Строка(Год(ДатаНачала))  КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие) Тогда ВЫБОР КОГДА Месяц(ДатаНачала) = 7 Тогда НСтр(""ru = '2 полугодие '; en = '2nd half '; es = '2 semestre '"") + Строка(Год(ДатаНачала))  ИНАЧЕ НСтр(""ru = '1 полугодие '; en = '1H '; es = '1 semestre '"") + Строка(Год(ДатаНачала)) КОНЕЦ КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год) Тогда Строка(ГОД(ДатаНачала)) ИНАЧЕ ДатаНачала КОНЕЦ");
	
	Для каждого Поле Из СхемаКомпоновкиДанных.ВычисляемыеПоля Цикл
		Выражение = Поля[Поле.ПутьКДанным];
		Если Выражение <> Неопределено Тогда
			Поле.Выражение = Выражение;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры
 
#КонецОбласти 
// << [Деснол] [Ушаков А.Д.] [04.10.2019]

ИспользоватьУчетСостоянийОборудования	= ПолучитьЗначениеФО("торо_УчетСостоянияОборудования");


#КонецОбласти


#КонецЕсли
